In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('C:/Users/RISHI/Desktop/Ajay/Msc/FDS/stats.csv')

In [3]:
df

        Name  Salary Country
0        Dan   40000     USA
1  Elizabeth   32000  Brazil
2        Jon   45000   Italy
3      Maria   54000     USA
4       Mark   72000     USA
5       Bill   62000  Brazil
6       Jess   92000   Italy
7      Julia   55000     USA
8       Jeff   35000   Italy
9        Ben   48000  Brazil

In [6]:
countrywise_sum=df.groupby(['Country']).sum()
countrywise_sum

         Salary
Country
Brazil   142000
Italy    172000
USA      221000

In [5]:
countrywise_count=df.groupby(['Country']).count()
countrywise_count

         Name  Salary
Country
Brazil      3       3
Italy       3       3
USA         4       4

In [7]:
#Variance of salary
var1=df['Salary'].var()
var1

332055555.5555556

In [8]:
#standard deviation
std1=df['Salary'].std()
std1

18222.391598128816

In [9]:
skew1=df.skew(axis=0,skipna=True)
skew1

Salary    1.021551
dtype: float64

In [ ]:
#The skewness is positve so x will have right side tail.

# Covariance and Correlation

In [10]:
bw=pd.read_csv('C:/Users/RISHI/Desktop/Ajay/Msc/FDS/BirthWeight.csv')
bw

    Infant ID  Gestational Age (Weeks)  Birth Weight (Grams)
0           1                     34.7                  1895
1           2                     36.0                  2030
2           3                     29.3                  1440
3           4                     40.1                  2835
4           5                     35.7                  3090
5           6                     42.4                  3827
6           7                     40.3                  3260
7           8                     37.3                  2690
8           9                     40.9                  3285
9          10                     38.3                  2920
10         11                     38.5                  3430
11         12                     41.4                  3657
12         13                     39.7                  3685
13         14                     39.7                  3345
14         15                     41.1                  3260
15         16                     38.0                  2680
16         17                     38.7                  2005

In [11]:
bw.set_index('Infant ID',inplace=True)
bw.head()

           Gestational Age (Weeks)  Birth Weight (Grams)
Infant ID
1                             34.7                  1895
2                             36.0                  2030
3                             29.3                  1440
4                             40.1                  2835
5                             35.7                  3090

bw.cov()

In [13]:
bw.corr(method='pearson')

                         Gestational Age (Weeks)  Birth Weight (Grams)
Gestational Age (Weeks)                 1.000000              0.817519
Birth Weight (Grams)                    0.817519              1.000000